{
    "pageTitle": "About - Lenin Hasda",
    "jumboTitle": "Learner, Programmer, *nix hacker",
    "bodyContent": "<blockquote>I can read and write code. </blockquote> <p>You already know one or two things about me, and seems like want to know little bit more.. sweet!</p> <h1 class=\"card-title\">What I do for living?</h1> <p>Professionally I am a full stack developer working at Ice9 Interactive Ltd. about 2+ years now. Before that I was a freelance developer for almost 2 years mainly working on oDesk ( currently known as upwork ).</p> <p>My focus is on LAMP/LEMP Stack and my primary skills include, but not limited to:</p> <p> <b>PHP:</b> CodeIgniter, Yii2 Framework, Laravel (basic), Slim, WordPress, Prestashop<br> <b>Front End:</b> JavaScript, jQuery, AngularJS, ReactJS, Bootstrap, HTML &amp; CSS<br> <b>NodeJS:</b> Express, MEAN, Socket.io, NodeWebkit<br> <b>Database:</b> MySQL, MariaDB, CouchDB, MongoDB, Redis<br> <b>Servers:</b> Ubuntu, CentOS, Apache, Nginx, DigitalOcean, MediaTemple, any kind of VPS server </p> <h1 class=\"card-title\">Little bit of background.</h1> <p>Although my current focus is on web development, my journey didn’t start with it. During my 4 years of university life at <a href=\"http://www.ewubd.edu/\">East West University</a> mostly I have coded with C and C++. There were other interesting tools I learned during the days, like MatLab, SWI-Prolog (during AI class), basic assembly during microprocessor class and the fun part, circuit lab and logic design lab.</p> <p>I was an ACM contestant and I rnjoyed participating in intra university contests as well as national level contests like NCPC and ICPC. I have also participated in development contests like TherapJava Fest (surprisingly was selected top 10!) by <a href=\"http://therapbd.com/\">Therap BD</a> and <a href=\"\">Code Warrior Challenge</a>. I love to attend different workshop and seminars because there is always something new to learn from it.</p> <h1 class=\"card-title\">… and the other me!</h1> <p>I love hacking and dig around anything thats interesting to me. Moving to a *nix environment helped me a lot. I use Ubuntu as my primary development envirment. When I need I use Vagrant to virtualize new environment to experiment with. Recently I am trying to learn and adapt Arch Linux which I think would be fun journey to learn new things.</p> <p>I am an open source enthusiast and contribute to github projects whenever I can. You can find most of the tools &amp; projects I have played with at <a href=\"https://github.com/\">https://github.com/leninhasda</a></p> <p>Apart from being a geeky coder, I am a hobbyist sketch artist. You will find most of my sketches here at <a href=\"http://leninhasda.deviantart.com\">http://leninhasda.deviantart.com</a>. Few other things I like are reading, cycling, anime, and for some strange reason guitar (although I can’t play but I am hoping to learn).</p> <p>Yap! That sums it up. Enjoy exploring rest of the site.</p>"
}